Catalogs/ВидыДокументовЭДОБЗК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыДокументовЭДОБЗК</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументСвязанныйСРаботой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКадровогоДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыДокументовКадровыхМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПечатнойФормы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПодписьОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСписокСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПодписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПодписанияДокументовЭДОБЗК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержимоеДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СодержимоеДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодготовленМакетДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭлектроннойПодписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлектронныхПодписейЭДОБЗК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыДокументовЭДОБЗК/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	МассивНеПроверяемыхРеквизитов = Новый Массив;
	Если Не ДокументСвязанныйСРаботой Тогда
		МассивНеПроверяемыхРеквизитов.Добавить("КодКадровогоДокумента");
	КонецЕсли;
	
	Если Не ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("3.3")
		Или ВариантПодписания <> Перечисления.ВариантыПодписанияДокументовЭДОБЗК.Требуется Тогда
		
		МассивНеПроверяемыхРеквизитов.Добавить("ТипЭлектроннойПодписи");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивНеПроверяемыхРеквизитов) Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНеПроверяемыхРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		Если ВариантПодписания <> Перечисления.ВариантыПодписанияДокументовЭДОБЗК.Требуется Тогда
			ТипЭлектроннойПодписи = Перечисления.ТипыЭлектронныхПодписейЭДОБЗК.ПустаяСсылка();
		ИначеЕсли Не ЗначениеЗаполнено(ТипЭлектроннойПодписи) Тогда
			ТипЭлектроннойПодписи = Перечисления.ТипыЭлектронныхПодписейЭДОБЗК.УНЭП;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
